# 01: Menyertakan Prefix dan Suffix pada seluruh Kolom Data Frame
# Import Modules

In [1]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.3.3
2.3.4

# Persiapan Data Frame

In [2]:
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 10, size=(n_rows, n_cols)), 
                  columns=cols)
df

   A  B  C  D  E
0  2  5  5  8  6
1  7  1  6  4  3
2  8  1  1  8  5
3  8  2  4  6  7
4  1  7  3  6  1

In [3]:
tuple('ABCDE')

('A', 'B', 'C', 'D', 'E')

# Menyertakan Prefix Kolom

In [4]:
df.add_prefix('kolom_')

   kolom_A  kolom_B  kolom_C  kolom_D  kolom_E
0        2        5        5        8        6
1        7        1        6        4        3
2        8        1        1        8        5
3        8        2        4        6        7
4        1        7        3        6        1

# Menyertakan Suffix Kolom

In [5]:
df.add_suffix('_field')

   A_field  B_field  C_field  D_field  E_field
0        2        5        5        8        6
1        7        1        6        4        3
2        8        1        1        8        5
3        8        2        4        6        7
4        1        7        3        6        1

# 02: Pemilihan baris (rows selection) pada Data Frame
# Import Modules

In [6]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.3.3
2.3.4

# Persiapan Data Frame

In [7]:
n_rows = 10
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 5, size=(n_rows, n_cols)), 
                  columns=cols)
df

   A  B  C  D  E
0  4  4  2  2  4
1  4  4  3  2  3
2  2  2  1  3  3
3  4  1  4  4  3
4  4  3  1  4  1
5  4  2  3  3  3
6  3  2  2  2  1
7  3  3  4  4  2
8  3  3  1  2  3
9  1  4  1  3  2

# Selection dengan operator logika |

In [8]:
df[(df['A'] == 1) | (df['A'] == 3)]

   A  B  C  D  E
6  3  2  2  2  1
7  3  3  4  4  2
8  3  3  1  2  3
9  1  4  1  3  2

# Selection dengan fungsi isin()

In [9]:
df[df['A'].isin([1, 3])]

   A  B  C  D  E
6  3  2  2  2  1
7  3  3  4  4  2
8  3  3  1  2  3
9  1  4  1  3  2

# Mengenal operator negasi ~

In [10]:
df[~df['A'].isin([1, 3])]

   A  B  C  D  E
0  4  4  2  2  4
1  4  4  3  2  3
2  2  2  1  3  3
3  4  1  4  4  3
4  4  3  1  4  1
5  4  2  3  3  3

# 03: Konversi tipe data String ke Numerik pada kolom Data Frame
# Import Modules

In [11]:
import pandas as pd

print(pd.__version__)

2.3.3

# Persiapan Data Frame

In [12]:
data = {'col1':['1', '2', '3', 'teks'], 
        'col2':['1', '2', '3', '4']}

df = pd.DataFrame(data)
df

   col1 col2
0     1    1
1     2    2
2     3    3
3  teks    4

In [13]:
df.dtypes

col1    object
col2    object
dtype: object

# Konversi tipe data dengan fungsi astype()

In [14]:
df_x = df.astype({'col2':'int'})
df_x

   col1  col2
0     1     1
1     2     2
2     3     3
3  teks     4

In [15]:
df_x.dtypes

col1    object
col2     int64
dtype: object

# Konversi tipe data numerik dengan fungsi to_numeric()

In [16]:
df.apply(pd.to_numeric, errors='coerce')

   col1  col2
0   1.0     1
1   2.0     2
2   3.0     3
3   NaN     4


# 04: Pemilihan kolom (columns selection) pada Data Frame berdasarkan tipe data
# Import Modules

In [17]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.3.3
2.3.4

# Persiapan Data Frame

In [18]:
## DEPRICATED ##
# n_rows = 5
# n_cols = 2
# cols = ['bil_pecahan', 'bil_bulat']

# df = pd.DataFrame(np.random.randint(1, 20, size=(n_rows, n_cols)), 
#                   columns=cols)
# df['bil_pecahan'] = df['bil_pecahan'].astype('float')

# df.index = pd.util.testing.makeDateIndex(n_rows, freq='H')
# df = df.reset_index()

# df['teks'] = list('ABCDE')

# df

In [19]:
n_rows = 5
n_cols = 2
cols = ['bil_pecahan', 'bil_bulat']

df = pd.DataFrame(np.random.randint(1, 20, size=(n_rows, n_cols)), columns=cols)

df['bil_pecahan'] = df['bil_pecahan'].astype('float')

df.index = pd.date_range(start='2024-10-01', periods=n_rows, freq='h')

df = df.reset_index()
df['teks'] = list('ABCDE')

df

                index  bil_pecahan  bil_bulat teks
0 2024-10-01 00:00:00         12.0          7    A
1 2024-10-01 01:00:00         14.0         16    B
2 2024-10-01 02:00:00          3.0          1    C
3 2024-10-01 03:00:00          2.0         11    D
4 2024-10-01 04:00:00         14.0         19    E

In [20]:
df.dtypes

index          datetime64[ns]
bil_pecahan           float64
bil_bulat               int32
teks                   object
dtype: object

# Memilih kolom bertipe data numerik

In [21]:
df.select_dtypes(include='number')

   bil_pecahan  bil_bulat
0         12.0          7
1         14.0         16
2          3.0          1
3          2.0         11
4         14.0         19

In [22]:
df.select_dtypes(include='float')

   bil_pecahan
0         12.0
1         14.0
2          3.0
3          2.0
4         14.0

In [23]:
df.select_dtypes(include='int')

   bil_bulat
0          7
1         16
2          1
3         11
4         19

# Memilih kolom bertipe data string atau object

In [24]:
df.select_dtypes(include='object')

  teks
0    A
1    B
2    C
3    D
4    E

# Memilih kolom bertipe data datetime

In [25]:
df.select_dtypes(include='datetime')

                index
0 2024-10-01 00:00:00
1 2024-10-01 01:00:00
2 2024-10-01 02:00:00
3 2024-10-01 03:00:00
4 2024-10-01 04:00:00

# Memilih kolom dengan kombinasi tipe data

In [26]:
df.select_dtypes(include=['number', 'object'])

   bil_pecahan  bil_bulat teks
0         12.0          7    A
1         14.0         16    B
2          3.0          1    C
3          2.0         11    D
4         14.0         19    E